Repository: Geoege-xll/quotio
Catalog: Quotio/Localizable.xcstrings
Source language: en
Languages: fr, vi, zh_hans, zh_hant

# settings.navigation.security.visible
source: Sensitive information visible
zh_hans: 敏感信息当前可见

# settings.navigation.service.subtitle
source: Listening port, startup, local network, upstream proxy and tunnels.
zh_hans: 监听端口、自动启动、局域网、上游代理与隧道。

# settings.navigation.service.title
source: CPA Service & Network
zh_hans: CPA 服务与网络

# settings.navigation.usage.subtitle
source: Quota presentation, usage aggregation and refresh cadence.
zh_hans: 额度展示、用量聚合与数据刷新频率。

# settings.navigation.usage.title
source: Quota & Usage
zh_hans: 配额与用量

# storage.cache.clear
source: Clear Caches
zh_hans: 清理缓存

# storage.cache.cleared
source: Caches cleared. Analytics history has been kept.
zh_hans: 缓存已清理，统计历史已保留。

# storage.cache.failed
source: Cache cleanup did not finish. Please try again.
zh_hans: 缓存清理未完成，请稍后重试。

# storage.cache.help
source: Clears rebuildable memory and network caches while keeping analytics history and scan progress. Deleted rows leave database pages available for reuse. Reclaiming free space can shrink the file and may take time for large databases.
zh_hans: 清理可重建的内存与网络缓存，保留统计历史和扫描进度。删除统计后，数据库空闲页会留给后续写入；回收空闲空间可尝试缩小文件，数据较多时需要等待。

# storage.cache.title
source: Caches & Space
zh_hans: 缓存与空间

# storage.compact.action
source: Reclaim Database Free Space
zh_hans: 回收数据库空闲空间

# storage.compact.completed
source: Database space reclamation completed.
zh_hans: 数据库空间整理已完成。

# storage.compact.failed
source: Database space reclamation did not finish. Please try again.
zh_hans: 数据库空间整理未完成，请稍后重试。

# storage.data.clear
source: Clear Selected Analytics Data…
zh_hans: 清除所选统计数据…

# storage.data.cleared
source: Selected analytics data cleared. Existing source logs can be imported again during future collection.
zh_hans: 所选统计数据已清除，现存源日志可在后续采集重新导入。

# storage.data.clearedRefreshFailed
source: Analytics data was cleared, but refreshing failed. Please reopen the analytics page.
zh_hans: 统计数据已清除，但页面刷新失败；请重新打开统计页面。

# storage.data.confirm.action
source: Clear Analytics Data
zh_hans: 清除统计数据

# storage.data.confirm.message
source: This will clear: %@. This cannot be undone. Client source logs are kept, and future collection may import existing history again.
zh_hans: 将清除：%@。此操作无法撤销。客户端源日志不会删除，后续采集可能再次导入现存历史。

# storage.data.confirm.title
source: Clear selected analytics data?
zh_hans: 清除所选统计数据？

# storage.data.failed
source: Could not clear analytics data. The database transaction preserved the existing data.
zh_hans: 统计数据清除失败，数据库事务已保留原有数据。

# storage.data.help
source: Clears only the selected modules’ local analytics, indexes, and scan progress. Accounts, settings, model prices, and client source logs are kept. Existing source logs can be imported again during the next collection; history whose source logs are gone cannot be recovered.
zh_hans: 仅清除所选模块的本地统计、索引与扫描进度，保留账户、配置、模型价格和客户端源日志。仍存在的源日志可在下次采集重新导入；源日志已消失的历史无法恢复。

# storage.data.title
source: Clear Analytics Data
zh_hans: 清除统计数据

# storage.database.file
source: Database file
zh_hans: 数据库文件

# storage.database.total
source: Total analytics storage
zh_hans: 统计存储总计

# storage.database.wal
source: Transaction log
zh_hans: 事务日志

# storage.inspect.failed
source: Could not read the storage overview. Please try again.
zh_hans: 无法读取存储概况，请稍后重试。

# storage.inspect.refresh
source: Refresh storage overview
zh_hans: 刷新存储概况

# storage.module.callAnalytics
source: Call Analytics
zh_hans: 调用分析

# storage.module.clientUsage
source: Usage Statistics
zh_hans: 用量统计

# storage.module.dashboard
source: Dashboard
zh_hans: 仪表盘

# storage.operation.running
source: Processing, please wait…
zh_hans: 正在处理，请稍候…

# storage.overview.help
source: Size includes the database and its transaction log. Row counts represent saved requests or aggregate rows, not the number of calls.
zh_hans: 大小包含数据库与事务日志。行数表示已保存的请求记录或统计汇总行，不等于调用次数。

# storage.overview.title
source: Storage Overview
zh_hans: 存储概况

# storage.title
source: Storage & Data
zh_hans: 存储与数据

# tunnel.title
source: Cloudflare Tunnel
zh_hans: Cloudflare 隧道

# usage.cpa.accounts
source: %lld accounts · %lld ready
zh_hans: %lld 个账号 · %lld 个就绪
zh_hant: %lld 個帳號 · %lld 個就緒

# usage.cpa.collectedAt
source: Last collection:
zh_hans: 最近采集：
zh_hant: 最近收集：

# usage.cpa.coverage
source: The dashboard preserves the collected CPA daily history. Cached tokens combine reads and writes. Open Usage Records for account/key/result filters, cancellations, TTFT and generation speed on newly collected requests. Missing historical details and costs are not reconstructed.
zh_hans: 仪表盘保留已采集的 CPA 日汇总，缓存 Token 合并读取与创建。账号、密钥、结果筛选，以及取消、首 Token 延迟和生成速度请进入“使用记录”查看新增明细；历史缺失数据和费用不进行推测。
zh_hant: 儀表盤保留已收集的 CPA 每日彙總，快取 Token 合併讀取與建立。帳號、金鑰、結果篩選，以及取消、首 Token 延遲和生成速度請進入「使用記錄」檢視新增明細；歷史缺失資料和費用不進行推測。

# usage.cpa.details
source: Trends and model distribution
zh_hans: 趋势与模型分布
zh_hant: 趨勢與模型分布

# usage.cpa.failedFlag
source: CPA failed flag; may include cancellations
zh_hans: CPA 失败标记，可能包含取消
zh_hant: CPA 失敗標記，可能包含取消

# usage.cpa.knownLatency
source: Only requests reporting latency
zh_hans: 仅统计已报告耗时的请求
zh_hant: 僅統計已回報耗時的請求

# usage.cpa.latency
source: Average request latency
zh_hans: 平均请求延迟
zh_hant: 平均請求延遲

# usage.cpa.legacyScope
source: This CPA version only provides process totals. Date, provider and model filters do not apply; unavailable token breakdowns are left blank.
zh_hans: 当前 CPA 仅提供进程累计值，不适用日期、提供方和模型筛选；未提供的 Token 明细显示占位符。
zh_hant: 目前 CPA 僅提供程序累計值，不適用日期、提供方和模型篩選；未提供的 Token 明細顯示預留符號。

# usage.cpa.modelDistribution
source: Model distribution
zh_hans: 模型用量分布
zh_hant: 模型用量分布

# usage.cpa.requests
source: Requests
zh_hans: 请求总数
zh_hant: 請求總數

# usage.cpa.resetFilters
source: Reset filters
zh_hans: 重置筛选
zh_hant: 重設篩選

# usage.cpa.selectedRange
source: Reported scope
zh_hans: 当前统计范围
zh_hant: 目前統計範圍

# usage.cpa.successFormula
source: Successful / all requests
zh_hans: 成功请求 ÷ 全部请求
zh_hant: 成功請求 ÷ 全部請求

# usage.cpa.successShare
source: Successful request share
zh_hans: 成功请求占比
zh_hant: 成功請求占比

# usage.cpa.title
source: CPA Usage
zh_hans: CPA 用量
zh_hant: CPA 用量

# usage.cpa.unsuccessful
source: Unsuccessful requests
zh_hans: 非成功请求
zh_hant: 非成功請求

# usage.dashboard.activeFilters
source: %d active
zh_hans: 已选 %d 项
zh_hant: 已選 %d 項

# usage.dashboard.additionalFilters
source: %d more
zh_hans: 另 %d 项
zh_hant: 另 %d 項

# usage.dashboard.allFilters
source: All Filters
zh_hans: 全部筛选
zh_hant: 全部篩選

# usage.dashboard.analysis
source: Usage Analysis
zh_hans: 用量分析
zh_hant: 用量分析

# usage.dashboard.archive
source: Daily archive: %@ requests · %@ Tokens. Includes history before event indexing; do not add this to the overview.
zh_hans: 日归档累计：%@ 次请求 · %@ Tokens。包含明细索引建立前的历史，不与上方总览相加。
zh_hant: 日歸檔累計：%@ 次請求 · %@ Tokens。包含明細索引建立前的歷史，不與上方總覽相加。

# usage.dashboard.cache
source: Cache
zh_hans: 缓存
zh_hant: 快取

# usage.dashboard.cacheRateShort
source: Read ratio
zh_hans: 读取比例
zh_hant: 讀取比例

# usage.dashboard.cacheReadShort
source: Read
zh_hans: 读取
zh_hant: 讀取

# usage.dashboard.cacheWriteShort
source: Write
zh_hans: 创建
zh_hant: 建立

# usage.dashboard.chartMetric
source: Chart metric
zh_hans: 图表指标
zh_hant: 圖表指標

# usage.dashboard.clickForRecords
source: Select an item to view requests
zh_hans: 点击项目查看请求
zh_hant: 點選項目查看請求

# usage.dashboard.collapseFilters
source: Collapse filters
zh_hans: 收起筛选
zh_hant: 收合篩選

# usage.dashboard.coverage
source: Overview and analysis combine retained CPA events with non-overlapping daily history. Request details and pricing use retained events only; missing historical metrics are not zero.
zh_hans: 总览与分析合并 CPA 事件及不重复的旧日归档；请求明细和价格统计仅查询已保存事件。历史缺失指标不代表零。
zh_hant: 總覽與分析合併 CPA 事件及不重複的舊日歸檔；請求明細和價格統計僅查詢已儲存事件。歷史缺失指標不代表零。

# usage.dashboard.coverageDetails
source: Statistics coverage
zh_hans: 统计范围说明
zh_hant: 統計範圍說明

# usage.dashboard.distribution
source: Usage Distribution
zh_hans: 用量分布
zh_hant: 用量分佈

# usage.dashboard.expandFilters
source: Expand filters
zh_hans: 展开筛选
zh_hant: 展開篩選

# usage.dashboard.filterHelp
source: About filters
zh_hans: 筛选说明
zh_hant: 篩選說明

# usage.dashboard.filterOptionsFailed
source: Couldn’t load all options. Previously loaded options remain available.
zh_hans: 无法加载全部选项，当前仍显示已读取的选项。
zh_hant: 無法載入全部選項，目前仍顯示已讀取的選項。

# usage.dashboard.filterOptionsLoading
source: Loading all filter options…
zh_hans: 正在加载全部筛选选项…
zh_hant: 正在載入全部篩選選項…

# usage.dashboard.filters
source: Filters
zh_hans: 筛选
zh_hant: 篩選

# usage.dashboard.filtersDraftHint
source: Choose your filters, then select Apply.
zh_hans: 调整筛选条件后点击“应用”。
zh_hant: 調整篩選條件後按一下「套用」。

# usage.dashboard.groupBy
source: Group by
zh_hans: 分组
zh_hant: 分組

# usage.dashboard.hiddenFilters
source: %d additional filters
zh_hans: %d 项附加条件
zh_hant: %d 項附加條件

# usage.dashboard.historyIncluded
source: Includes %@ requests from daily history. Trends use daily totals; request details and pricing only cover retained events. Historical cancellations, cache splits and generation metrics cannot be recovered.
zh_hans: 已纳入日归档中的 %@ 次请求，趋势按天展示；请求明细与价格统计仅覆盖已保存事件。历史取消数、缓存拆分和生成指标无法补回。
zh_hant: 已納入日歸檔中的 %@ 次請求，趨勢按天展示；請求明細與價格統計僅涵蓋已儲存事件。歷史取消數、快取拆分和生成指標無法補回。

# usage.dashboard.historyIncomplete
source: Some daily history cannot be resolved with these exact time or metadata filters. Values cover the known subset; ≥ marks a lower bound and — means unavailable. Choose All with model/provider filters to include daily history.
zh_hans: 部分日归档无法按当前精确时间或其他条件筛选，当前仅展示可确认部分；≥ 表示下界，— 表示无法确定。选择“全部”时间并仅按模型或提供商筛选，可完整纳入日归档。
zh_hant: 部分日歸檔無法依目前精確時間或其他條件篩選，目前僅展示可確認部分；≥ 表示下界，— 表示無法確定。選擇「全部」時間並僅依模型或提供商篩選，可完整納入日歸檔。

# usage.dashboard.historySummary
source: Includes %@ requests from daily history
zh_hans: 已纳入 %@ 次历史请求
zh_hant: 已納入 %@ 次歷史請求

# usage.dashboard.inputOutput
source: Input / Output
zh_hans: 输入 / 输出
zh_hant: 輸入 / 輸出

# usage.dashboard.inputShort
source: Input
zh_hans: 输入
zh_hant: 輸入

# usage.dashboard.moreFilters
source: More Filters
zh_hans: 更多筛选
zh_hant: 更多篩選

# usage.dashboard.outputShort
source: Output
zh_hans: 输出
zh_hant: 輸出

# usage.dashboard.overview
source: Overview
zh_hans: 总览
zh_hant: 總覽

# usage.dashboard.partialCoverage
source: Some history cannot match the current filters
zh_hans: 部分历史无法匹配当前筛选
zh_hant: 部分歷史無法符合目前篩選

# usage.dashboard.performance
source: Performance & throughput
zh_hans: 性能与吞吐
zh_hant: 效能與吞吐

# usage.dashboard.rankingMetric
source: Ranking Metric
zh_hans: 排行指标
zh_hant: 排行指標

# usage.dashboard.rankingNote
source: Sorted by usage; percentages include all matching requests.
zh_hans: 按用量排序，占比按全部匹配请求计算。
zh_hant: 按用量排序，佔比按全部匹配請求計算。

# usage.dashboard.reasoningShort
source: Reasoning
zh_hans: 推理
zh_hant: 推理

# usage.dashboard.records
source: Request Details
zh_hans: 请求明细
zh_hant: 請求明細

# usage.dashboard.requestOutcomes
source: Request outcomes
zh_hans: 请求结果
zh_hant: 請求結果

# usage.dashboard.search
source: Search by name
zh_hans: 搜索名称
zh_hant: 搜尋名稱

# usage.dashboard.showMore
source: Show More
zh_hans: 显示更多
zh_hant: 顯示更多

# usage.dashboard.tokenAndCache
source: Tokens & cache
zh_hans: Token 与缓存
zh_hant: Token 與快取

# usage.dashboard.tokenUsage
source: Token usage
zh_hans: Token 用量
zh_hant: Token 用量

# usage.dashboard.topEight
source: Show Top 8
zh_hans: 仅显示前 8 项
zh_hant: 僅顯示前 8 項

# usage.dashboard.trend
source: Usage Trend
zh_hans: 用量趋势
zh_hant: 用量趨勢

# usage.dashboard.trendNote
source: Hourly for short ranges, daily for longer ranges. Long histories are merged into at most 240 intervals. Hover for values.
zh_hans: 短范围按小时、长范围按天；超长历史合并为最多 240 个区间。悬停查看数值。
zh_hant: 短範圍按小時、長範圍按天；超長歷史合併為最多 240 個區間。懸停查看數值。

# usage.metric.unavailable
source: This metric was not reported.
zh_hans: 数据源未报告该指标。
zh_hant: 資料來源未回報此指標。

# usage.modelDetails
source: Model Details
zh_hans: 模型详情

# usage.pi.reasoningUnavailable
source: Some Pi records do not report reasoning tokens. The reasoning subtotal is unavailable; reported tokens remain included in output and total tokens.
zh_hans: 部分 Pi 记录未报告思考 Token 明细，因此不显示思考小计；已报告的消耗仍计入输出和总 Token。
zh_hant: 部分 Pi 記錄未回報思考 Token 明細，因此不顯示思考小計；已回報的消耗仍計入輸出和總 Token。

# usage.pricing.cacheReadPrice
source: Cache Read / 1M
zh_hans: 缓存读取 / 百万
zh_hant: 快取讀取 / 百萬

# usage.pricing.cacheWritePrice
source: Cache Write / 1M
zh_hans: 缓存写入 / 百万
zh_hant: 快取寫入 / 百萬

# usage.pricing.configurePrice
source: Configure price
zh_hans: 设置单价
zh_hant: 設定單價

# usage.pricing.coverage
source: Pricing Coverage
zh_hans: 计价覆盖率
zh_hant: 計價覆蓋率

# usage.pricing.edit
source: Configure Model Price
zh_hans: 配置模型价格
zh_hant: 設定模型價格

# usage.pricing.editHelp
source: Use a decimal point, for example 0.25. Input and output rates are required. Blank cache rates mean unconfigured; an explicit 0 means free. Prices match the recorded model name.
zh_hans: 使用小数点输入，例如 0.25。输入和输出单价必填；缓存单价留空表示未配置，填写 0 才表示免费。按记录中的模型名称匹配价格。
zh_hant: 使用小數點輸入，例如 0.25。輸入和輸出單價必填；快取單價留空表示未設定，填寫 0 才表示免費。按記錄中的模型名稱匹配價格。

# usage.pricing.estimated
source: Estimated Cost
zh_hans: 估算费用
zh_hant: 估算費用

# usage.pricing.formula
source: Cost = non-cached input × input rate + output × output rate + cache read × read rate + cache write × write rate, divided by 1,000,000. Reasoning is not added twice.
zh_hans: 费用 =（非缓存输入 × 输入单价 + 输出 × 输出单价 + 缓存读取 × 读取单价 + 缓存写入 × 写入单价）÷ 1,000,000；推理 Tokens 不重复计费。
zh_hant: 費用 =（非快取輸入 × 輸入單價 + 輸出 × 輸出單價 + 快取讀取 × 讀取單價 + 快取寫入 × 寫入單價）÷ 1,000,000；推理 Tokens 不重複計費。

# usage.pricing.historyNotice
source: %@ historical requests are included. Configure model prices to estimate the known token components; unknown cache details remain unpriced.
zh_hans: 已纳入 %@ 次历史请求。设置模型单价后可估算已知 Token 分量；未知缓存拆分仍保留为未计价。
zh_hant: 已納入 %@ 次歷史請求。設定模型單價後可估算已知 Token 分量；未知快取拆分仍保留為未計價。

# usage.pricing.historyRow
source: %@ historical requests
zh_hans: 含 %@ 次历史请求
zh_hant: 含 %@ 次歷史請求

# usage.pricing.incomplete
source: Priced requests / all matching requests. Missing cache breakdowns or rates reduce coverage.
zh_hans: 已估算请求 / 全部匹配请求。缺少缓存拆分或对应单价时不计入估算覆盖率。
zh_hant: 已估算請求 / 全部匹配請求。缺少快取拆分或對應單價時不計入估算覆蓋率。

# usage.pricing.inputPrice
source: Input / 1M
zh_hans: 输入 / 百万
zh_hant: 輸入 / 百萬

# usage.pricing.notice
source: Standard-rate estimates from manually configured model prices, not invoices. Subscription, long-context and service-tier adjustments are not applied. Unpriced or incomplete requests are excluded; coverage is shown separately.
zh_hans: 按手动配置的模型标准单价估算，不是实际账单；不包含订阅、长上下文和服务等级调整。未配置价格或字段不完整的请求不计入费用，覆盖率单独展示。
zh_hant: 按手動設定的模型標準單價估算，不是實際帳單；不包含訂閱、長上下文和服務等級調整。未設定價格或欄位不完整的請求不計入費用，覆蓋率單獨顯示。

# usage.pricing.outputPrice
source: Output / 1M
zh_hans: 输出 / 百万
zh_hant: 輸出 / 百萬

# usage.pricing.partialEstimate
source: Partial estimate
zh_hans: 部分估算
zh_hant: 部分估算

# usage.pricing.partialNotice
source: Only usage with known token components and configured prices is estimated. Unpriced usage and unknown cache components are excluded; ≥ indicates a lower bound.
zh_hans: 仅估算 Token 分量明确且已配置单价的部分。未配置单价的用量和未知缓存分量未计入费用；“≥”表示已知费用下界。
zh_hant: 僅估算 Token 分量明確且已設定單價的部分。未設定單價的用量與未知快取分量未計入費用；「≥」表示已知費用下限。

# usage.pricing.pricedRequests
source: Priced Requests
zh_hans: 已估算请求
zh_hant: 已估算請求

# usage.pricing.saveFailed
source: Could not save the model price. The previous configuration was preserved.
zh_hans: 模型价格保存失败，原配置保持不变。
zh_hant: 模型價格儲存失敗，原設定保持不變。

# usage.pricing.title
source: Price Statistics
zh_hans: 价格统计
zh_hant: 價格統計

# usage.pricing.unconfigured
source: No model price configured. This is not a free request.
zh_hans: 模型价格未配置，不代表请求免费。
zh_hant: 模型價格未設定，不代表請求免費。

# usage.pricing.unit
source: USD per million Tokens
zh_hans: 美元 / 百万 Tokens
zh_hant: 美元 / 百萬 Tokens

# usage.pricing.unpricedRow
source: No model prices are configured. Set prices to calculate an estimate.
zh_hans: 尚未设置模型单价，设置后可计算估算费用。
zh_hant: 尚未設定模型單價，設定後可計算估算費用。

# usage.records.alias
source: Model alias
zh_hans: 模型别名
zh_hant: 模型別名

# usage.records.apiKey
source: API key
zh_hans: API 密钥
zh_hant: API 金鑰

# usage.records.cacheRate
source: Cache-read ratio
zh_hans: 缓存读取比例
zh_hant: 快取讀取比例

# usage.records.cacheRead
source: Cache-read tokens
zh_hans: 缓存读取 Token
zh_hant: 快取讀取 Token

# usage.records.cacheWrite
source: Cache-creation tokens
zh_hans: 缓存创建 Token
zh_hant: 快取建立 Token

# usage.records.coverage
source: Only requests saved since detailed collection began are available here. Existing daily history remains on the dashboard and cannot be reconstructed into individual records. All times use the local time zone.
zh_hans: 此处仅包含开始保存明细后采集的请求；原有日汇总保留在仪表盘，无法反推单条记录。时间筛选采用本地时区。
zh_hant: 此處僅包含開始儲存明細後收集的請求；原有每日彙總保留在儀表盤，無法反推單筆記錄。時間篩選採用本機時區。

# usage.records.day
source: Date
zh_hans: 日期
zh_hant: 日期

# usage.records.detail
source: Request details
zh_hans: 请求详情
zh_hant: 請求詳情

# usage.records.effort
source: Reasoning effort
zh_hans: 思考强度
zh_hant: 思考強度

# usage.records.empty
source: No saved requests match these filters. Try a broader range, or wait for new CPA requests to be collected.
zh_hans: 暂无符合筛选条件的已保存请求。请扩大范围，或等待采集新的 CPA 请求。
zh_hant: 暫無符合篩選條件的已儲存請求。請擴大範圍，或等待收集新的 CPA 請求。

# usage.records.endpoint
source: Request route
zh_hans: 请求路由
zh_hant: 請求路由

# usage.records.history
source: Historical daily summaries
zh_hans: 历史日汇总
zh_hant: 歷史每日彙總

# usage.records.historyAvailable
source: %@ historical requests are available as daily summaries.
zh_hans: 另有 %@ 次历史请求保存在日汇总中。
zh_hant: 另有 %@ 次歷史請求儲存在每日彙總中。

# usage.records.historyCount
source: %@ daily summaries · %@ requests
zh_hans: %@ 条日汇总 · %@ 次请求
zh_hant: %@ 條每日彙總 · %@ 次請求

# usage.records.historyDays
source: Days with usage
zh_hans: 有用量天数
zh_hant: 有用量天數

# usage.records.historyModels
source: Models
zh_hans: 模型数量
zh_hant: 模型數量

# usage.records.historyNotice
source: These summaries were saved before individual request details were retained. They preserve daily usage, but cannot reconstruct individual requests.
zh_hans: 这些历史仅保存了按日用量，未保存单次请求详情，无法还原为逐条请求。
zh_hant: 這些歷史僅儲存了每日用量，未儲存單次請求詳情，無法還原為逐條請求。

# usage.records.historyOmitted
source: %@ historical requests cannot be matched precisely to the selected time or metadata filters.
zh_hans: 另有 %@ 次历史请求无法精确匹配当前时间或附加筛选条件。
zh_hant: 另有 %@ 次歷史請求無法精確符合目前時間或附加篩選條件。

# usage.records.historyRequests
source: Historical requests
zh_hans: 历史请求
zh_hant: 歷史請求

# usage.records.legacy
source: This CPA version does not provide supported request events. Previously saved records remain available; no events are fabricated from process totals.
zh_hans: 当前 CPA 版本未提供支持的请求事件。已有明细仍可查看，不会根据进程累计值虚构请求记录。
zh_hant: 目前 CPA 版本未提供支援的請求事件。已有明細仍可檢視，不會根據程序累計值虛構請求記錄。

# usage.records.metricRules
source: Success rate excludes cancellations. RPM/TPM are averages over the selected interval (minimum one minute); All uses the first-to-last event span. TPS uses successful generation samples with valid TTFT: output tokens / (latency − TTFT). Latency and TTFT averages include only reported samples; incomplete cache breakdowns are left blank. No prices or costs are inferred.
zh_hans: 成功率排除取消请求。RPM/TPM 为所选时间窗口的平均值，窗口最少按一分钟计算；全部记录使用首末事件跨度。TPS 仅使用有有效 TTFT 的成功生成样本，按输出 Token ÷（总延迟－TTFT）计算。延迟均值仅纳入已报告样本，缓存明细不完整时留空，不推测价格或费用。
zh_hant: 成功率排除取消請求。RPM/TPM 為所選時間視窗的平均值，視窗最少按一分鐘計算；全部記錄使用首末事件跨度。TPS 僅使用有有效 TTFT 的成功生成樣本，按輸出 Token ÷（總延遲－TTFT）計算。延遲均值僅納入已回報樣本，快取明細不完整時留空，不推測價格或費用。

# usage.records.moreMetrics
source: More metrics and calculation rules
zh_hans: 更多指标与统计口径
zh_hant: 更多指標與統計口徑

# usage.records.next
source: Next page
zh_hans: 下一页
zh_hant: 下一頁

# usage.records.noIndividualDescription
source: Older versions retained daily totals only. Open Historical daily summaries to inspect that usage; new collected requests will appear here.
zh_hans: 旧版本只保留了每日总量。可切换到“历史日汇总”查看；新采集的请求会显示在这里。
zh_hant: 舊版本僅保留每日總量。可切換至「歷史每日彙總」查看；新採集的請求會顯示在這裡。

# usage.records.noIndividualTitle
source: No individual request details saved
zh_hans: 尚未保存单次请求明细
zh_hant: 尚未儲存單次請求明細

# usage.records.noMatches
source: No data matches the current filters. Try a broader time range or reset the filters.
zh_hans: 没有匹配当前筛选的数据，可扩大时间范围或重置筛选。
zh_hant: 沒有符合目前篩選的資料，可擴大時間範圍或重設篩選。

# usage.records.open
source: Usage records
zh_hans: 使用记录
zh_hant: 使用記錄

# usage.records.outcome.all
source: All
zh_hans: 全部
zh_hant: 全部

# usage.records.outcome.canceled
source: Canceled
zh_hans: 取消
zh_hant: 取消

# usage.records.outcome.failed
source: Failed
zh_hans: 失败
zh_hant: 失敗

# usage.records.outcome.success
source: Success
zh_hans: 成功
zh_hant: 成功

# usage.records.pageInfo
source: Page %lld of %lld · %lld records
zh_hans: 第 %lld / %lld 页 · %lld 条记录
zh_hant: 第 %lld / %lld 頁 · %lld 筆記錄

# usage.records.pageSize
source: Rows per page
zh_hans: 每页条数
zh_hant: 每頁筆數

# usage.records.previous
source: Previous page
zh_hans: 上一页
zh_hant: 上一頁

# usage.records.privacy
source: Account sources use hashed IDs; API keys use masks and short fingerprints. These are credential sources, not client applications.
zh_hans: 账号来源使用脱敏编号，API 密钥使用掩码及短指纹。这里是凭据来源，不是客户端应用类型。
zh_hant: 帳號來源使用去識別化編號，API 金鑰使用遮罩及短指紋。此處是憑證來源，不是客戶端應用程式類型。

# usage.records.range
source: Time range
zh_hans: 时间范围
zh_hant: 時間範圍

# usage.records.range.4h
source: Last 4 hours
zh_hans: 近 4 小时
zh_hant: 近 4 小時

# usage.records.range.7d
source: Last 7 days
zh_hans: 近 7 天
zh_hant: 近 7 天

# usage.records.range.24h
source: Last 24 hours
zh_hans: 近 24 小时
zh_hant: 近 24 小時

# usage.records.range.30d
source: Last 30 days
zh_hans: 近 30 天
zh_hant: 近 30 天

# usage.records.range.all
source: All records
zh_hans: 全部记录
zh_hant: 全部記錄

# usage.records.range.custom
source: Custom dates and times
zh_hans: 自定义日期与时间
zh_hant: 自訂日期與時間

# usage.records.range.today
source: Today
zh_hans: 今日
zh_hant: 今日

# usage.records.readFailed
source: Could not read usage records. Previous results, if shown, may be stale. Check storage permissions and retry.
zh_hans: 读取使用记录失败；若仍显示上次结果，其数据可能已过期。请检查存储权限后重试。
zh_hant: 讀取使用記錄失敗；若仍顯示上次結果，其資料可能已過期。請檢查儲存權限後重試。

# usage.records.result
source: Result
zh_hans: 请求结果
zh_hant: 請求結果

# usage.records.rpm
source: Requests per minute · RPM
zh_hans: 每分钟请求 · RPM
zh_hant: 每分鐘請求 · RPM

# usage.records.source
source: Account source
zh_hans: 账号来源
zh_hant: 帳號來源

# usage.records.startedAt
source: Detailed collection started:
zh_hans: 明细采集起始：
zh_hant: 明細收集起始：

# usage.records.statusCode
source: Failure status code
zh_hans: 失败状态码
zh_hant: 失敗狀態碼

# usage.records.successRate
source: Success rate, excluding canceled
zh_hans: 成功率（排除取消）
zh_hant: 成功率（排除取消）

# usage.records.time
source: Time
zh_hans: 请求时间
zh_hant: 請求時間

# usage.records.title
source: CPA Usage Records
zh_hans: CPA 使用记录
zh_hant: CPA 使用記錄

# usage.records.tpm
source: Tokens per minute · TPM
zh_hans: 每分钟 Token · TPM
zh_hant: 每分鐘 Token · TPM

# usage.records.tps
source: Generation speed · TPS
zh_hans: 生成速度 · TPS
zh_hant: 生成速度 · TPS

# usage.records.ttft
source: Time to first token · TTFT
zh_hans: 首 Token 延迟 · TTFT
zh_hant: 首 Token 延遲 · TTFT

# usage.records.unknown
source: Not reported
zh_hans: 未提供
zh_hant: 未提供

# workspace.tab.sessions
source: Sessions
zh_hans: 会话浏览
zh_hant: 會話瀏覽

# workspace.tab.skills
source: Skills
zh_hans: 技能管理
zh_hant: 技能管理

# workspace.tab.storage
source: Storage & Cache
zh_hans: 缓存与空间
zh_hant: 緩存與空間
